unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE9xI/inc/K1986VE9xI.h
/**
  * FILE K1986VE9xI.h
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __K1986VE9xI_H
#define __K1986VE9xI_H

/** @addtogroup __CMSIS CMSIS
  * @{
  */

/** @defgroup K1986VE9xI K1986VE9xI
 *  @{
 */

/** @defgroup __K1986VE9xI_Peripheral K1986VE9xI Peripheral
  * @{
  */

#ifdef __cplusplus
extern "C" {
#endif

#if defined ( __CC_ARM   )
  #pragma anon_unions
#endif

/* K1986VE9xI Interrupt Number Definition */
typedef enum IRQn
{
/*---- Processor Exceptions Numbers ------------------------------------------*/
/* Attention for NonMaskableInt_IRQn: */
/* Called by software only (bit [31] of the ICSR register). Used for mission critical applications */
  NonMaskableInt_IRQn     = -14,  /*!<  2 Non Maskable Interrupt              *///!< NonMaskableInt_IRQn
  HardFault_IRQn          = -13,  /*!<  3 Hard Fault Interrupt                *///!< HardFault_IRQn
  MemoryManagement_IRQn   = -12,  /*!<  4 Memory Management Interrupt         *///!< MemoryManagement_IRQn
  BusFault_IRQn           = -11,  /*!<  5 Bus Fault Interrupt                 *///!< BusFault_IRQn
  UsageFault_IRQn         = -10,  /*!<  6 Usage Fault Interrupt               *///!< UsageFault_IRQn
  SVCall_IRQn             = -5,   /*!< 11 SV Call Interrupt                   *///!< SVCall_IRQn
  PendSV_IRQn             = -2,   /*!< 14 Pend SV Interrupt                   *///!< PendSV_IRQn
  SysTick_IRQn            = -1,   /*!< 15 System Tick Timer Interrupt         *///!< SysTick_IRQn

/*---- K1986VE9xI specific Interrupt Numbers ---------------------------------*/
  CAN1_IRQn               =  0,   /*!< CAN1 Interrupt                         *///!< CAN1_IRQn
  CAN2_IRQn               =  1,   /*!< CAN1 Interrupt                         *///!< CAN2_IRQn
  USB_IRQn                =  2,   /*!< USB Host Interrupt                     *///!< USB_IRQn
  DMA_IRQn                =  5,   /*!< DMA Interrupt                          *///!< DMA_IRQn
  UART1_IRQn              =  6,   /*!< UART1 Interrupt                        *///!< UART1_IRQn
  UART2_IRQn              =  7,   /*!< UART2 Interrupt                        *///!< UART2_IRQn
  SSP1_IRQn               =  8,   /*!< SSP1 Interrupt                         *///!< SSP1_IRQn
  I2C_IRQn                =  10,  /*!< I2C Interrupt                          *///!< I2C_IRQn
  POWER_IRQn              =  11,  /*!< POWER Detecor Interrupt                *///!< POWER_IRQn
  WWDG_IRQn               =  12,  /*!< Window Watchdog Interrupt              *///!< WWDG_IRQn
  Timer1_IRQn             =  14,  /*!< Timer1 Interrupt                       *///!< Timer1_IRQn
  Timer2_IRQn             =  15,  /*!< Timer2 Interrupt                       *///!< Timer2_IRQn
  Timer3_IRQn             =  16,  /*!< Timer3 Interrupt                       *///!< Timer3_IRQn
  ADC_IRQn                =  17,  /*!< ADC Interrupt                          *///!< ADC_IRQn
  COMPARATOR_IRQn         =  19,  /*!< COMPARATOR Interrupt                   *///!< COMPARATOR_IRQn
  SSP2_IRQn               =  20,  /*!< SSP2 Interrupt                         *///!< SSP2_IRQn
  BACKUP_IRQn             =  27,  /*!< BACKUP Interrupt                       *///!< BACKUP_IRQn
  EXT_INT1_IRQn           =  28,  /*!< EXT_INT1 Interrupt                     *///!< EXT_INT1_IRQn
  EXT_INT2_IRQn           =  29,  /*!< EXT_INT2 Interrupt                     *///!< EXT_INT2_IRQn
  EXT_INT3_IRQn           =  30,  /*!< EXT_INT3 Interrupt                     *///!< EXT_INT3_IRQn
  EXT_INT4_IRQn           =  31   /*!< EXT_INT4 Interrupt                     *///!< EXT_INT4_IRQn
}IRQn_Type;

/** @addtogroup __Configuration_of_CMSIS Configuration of CMSIS
  * @{
  */

/* Configuration of the Processor and Core Peripherals */
#define __CM3_REV              0x0102   /*!< Core Revision                                */
#define __MPU_PRESENT             1     /*!< MPU present or not                           */
#define __NVIC_PRIO_BITS          3     /*!< Number of Bits used for Priority Levels      */
#define __Vendor_SysTickConfig    0     /*!< Set to 1 if different SysTick Config is used */

/** @} */ /* End of group __Configuration_of_CMSIS */

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_config.h"
#include "core_cm3.h"
#include "system_K1986VE9xI.h"

/** @defgroup __Exported_types Exported types
  * @{
  */

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus, BitStatus;

#define IS_BIT_STATUS(STATUS)	(((STATUS) == RESET) || ((STATUS) == SET))

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/** @} */ /* End of group __Exported_types */

/** @addtogroup __Memory_Map Memory Map
  * @{
  */

#define ROM_BOOT_BASE            ((uint32_t)0x00000000)
#define ROM_BOOT_SIZE            ((uint32_t)0x00000400)

#define EEPROM_BASE              ((uint32_t)0x08000000)
#define EEPROM_SIZE              ((uint32_t)0x00020000)

#define EEPROM_FACTORY_DATA_BASE ((uint32_t)0x08000F80)
#define EEPROM_FACTORY_DATA_SIZE ((uint32_t)0x00000080)

#define EBC_CODE_BASE            ((uint32_t)0x10000000)
#define EBC_CODE_SIZE            ((uint32_t)0x10000000)

#define RAM_AHB_BASE             ((uint32_t)0x20000000)
#define RAM_AHB_SIZE             ((uint32_t)0x00008000)

#define RAM_AHB_BB_BASE          ((uint32_t)0x22000000)
#define RAM_AHB_BB_SIZE          ((uint32_t)0x00100000)

#define EBC_DATA_BASE            ((uint32_t)0x30000000)
#define EBC_DATA_SIZE            ((uint32_t)0x10000000)

#define PERIPH_BASE              ((uint32_t)0x40000000)
#define PERIPH_SIZE              ((uint32_t)0x00100000)

#define PERIPH_BB_BASE           ((uint32_t)0x42000000)
#define PERIPH_BB_SIZE           ((uint32_t)0x02000000)

#define EBC_PERIPH_BASE          ((uint32_t)0x50000000)
#define EBC_PERIPH_SIZE          ((uint32_t)0x10000000)

#define EBC_RAM_BASE             ((uint32_t)0x60000000)
#define EBC_RAM_SIZE             ((uint32_t)0x40000000)

#define EBC_DEVICE_BASE          ((uint32_t)0xA0000000)
#define EBC_DEVICE_SIZE          ((uint32_t)0x40000000)

