unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE9xI/inc/K1986VE9xI.h
/** @} */ /* End of group __Memory_Map */

/** @defgroup __Peripheral_Memory_Map Peripheral Memory Map
  * @{
  */

#define MDR_CAN1_BASE       (PERIPH_BASE + (uint32_t)0x00000000)
#define MDR_CAN2_BASE       (PERIPH_BASE + (uint32_t)0x00008000)
#define MDR_USB_BASE        (PERIPH_BASE + (uint32_t)0x00010000)
#define MDR_EEPROM_BASE     (PERIPH_BASE + (uint32_t)0x00018000)
#define MDR_RST_CLK_BASE    (PERIPH_BASE + (uint32_t)0x00020000)
#define MDR_DMA_BASE        (PERIPH_BASE + (uint32_t)0x00028000)
#define MDR_UART1_BASE      (PERIPH_BASE + (uint32_t)0x00030000)
#define MDR_UART2_BASE      (PERIPH_BASE + (uint32_t)0x00038000)
#define MDR_SSP1_BASE       (PERIPH_BASE + (uint32_t)0x00040000)
#define MDR_I2C_BASE        (PERIPH_BASE + (uint32_t)0x00050000)
#define MDR_POWER_BASE      (PERIPH_BASE + (uint32_t)0x00058000)
#define MDR_WWDG_BASE       (PERIPH_BASE + (uint32_t)0x00060000)
#define MDR_IWDG_BASE       (PERIPH_BASE + (uint32_t)0x00068000)
#define MDR_TIMER1_BASE     (PERIPH_BASE + (uint32_t)0x00070000)
#define MDR_TIMER2_BASE     (PERIPH_BASE + (uint32_t)0x00078000)
#define MDR_TIMER3_BASE     (PERIPH_BASE + (uint32_t)0x00080000)
#define MDR_ADC_BASE        (PERIPH_BASE + (uint32_t)0x00088000)
#define MDR_DAC_BASE        (PERIPH_BASE + (uint32_t)0x00090000)
#define MDR_COMP_BASE       (PERIPH_BASE + (uint32_t)0x00098000)
#define MDR_SSP2_BASE       (PERIPH_BASE + (uint32_t)0x000A0000)
#define MDR_PORTA_BASE      (PERIPH_BASE + (uint32_t)0x000A8000)
#define MDR_PORTB_BASE      (PERIPH_BASE + (uint32_t)0x000B0000)
#define MDR_PORTC_BASE      (PERIPH_BASE + (uint32_t)0x000B8000)
#define MDR_PORTD_BASE      (PERIPH_BASE + (uint32_t)0x000C0000)
#define MDR_PORTE_BASE      (PERIPH_BASE + (uint32_t)0x000C8000)
#define MDR_BKP_BASE        (PERIPH_BASE + (uint32_t)0x000D8000)
#define MDR_PORTF_BASE      (PERIPH_BASE + (uint32_t)0x000E8000)
#define MDR_EBC_BASE        (PERIPH_BASE + (uint32_t)0x000F0000)

/** @} */ /* End of group __Peripheral_Memory_Map */

/** @addtogroup __K1986VE9xI_Memory_Units K1986VE9xI Memory Units
  * @{
  */

/** @defgroup K1986VE9xI_Memory_EEPROM_FACTORY_DATA EEPROM FACTORY_DATA
  * @{
  */

/** @defgroup K1986VE9xI_Memory_EEPROM_FACTORY_DATA_Addresses_for_Register_Access Addresses for Register Access
  * @{
  */

#define EEPROM_FACTORY_DATA_LSI_TRIM  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000000)
#define EEPROM_FACTORY_DATA_HSI_TRIM  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000010)
#define EEPROM_FACTORY_DATA_LDO_TRIM  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000020)
#define EEPROM_FACTORY_DATA_UNIQ_ID0  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000030)
#define EEPROM_FACTORY_DATA_UNIQ_ID1  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000040)
#define EEPROM_FACTORY_DATA_UNIQ_ID2  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000050)
#define EEPROM_FACTORY_DATA_UNIQ_ID3  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000060)
#define EEPROM_FACTORY_DATA_UNIQ_ID4  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000070)

/** @} */ /* End of group K1986VE9xI_Memory_EEPROM_FACTORY_DATA_Addresses_for_Register_Access */

/** @defgroup K1986VE9xI_Memory_EEPROM_FACTORY_DATA_Defines Defines
  * @{
  */

/** @defgroup Memory_EEPROM_FACTORY_DATA_LSI_TRIM EEPROM FACTORY_DATA LSI_TRIM
  * @{
  */

/*-- EEPROM_FACTORY_DATA_LSI_TRIM: EEPROM FACTORY_DATA LSI_TRIM Field -----*/
/* Bit field positions: */
#define EEPROM_FACTORY_DATA_LSI_TRIM_LSI_TRIM_Pos  0

/* Bit field masks: */
#define EEPROM_FACTORY_DATA_LSI_TRIM_LSI_TRIM_Msk  ((uint32_t)0x0000001F)

/** @} */ /* End of group Memory_EEPROM_FACTORY_DATA_LSI_TRIM */

/** @defgroup Memory_EEPROM_FACTORY_DATA_HSI_TRIM EEPROM FACTORY_DATA HSI_TRIM
  * @{
  */

/*-- EEPROM_FACTORY_DATA_HSI_TRIM: EEPROM FACTORY_DATA HSI_TRIM Field -----*/
/* Bit field positions: */
#define EEPROM_FACTORY_DATA_HSI_TRIM_HSI_TRIM_Pos  0

/* Bit field masks: */
#define EEPROM_FACTORY_DATA_HSI_TRIM_HSI_TRIM_Msk  ((uint32_t)0x0000003F)

/** @} */ /* End of group Memory_EEPROM_FACTORY_DATA_HSI_TRIM */

/** @defgroup Memory_EEPROM_FACTORY_DATA_LDO_TRIM EEPROM FACTORY_DATA LDO_TRIM
  * @{
  */

/*-- EEPROM_FACTORY_DATA_LDO_TRIM: EEPROM FACTORY_DATA LDO_TRIM Field -----*/
/* Bit field positions: */
#define EEPROM_FACTORY_DATA_LDO_TRIM_LDO_TRIM_Pos  0

/* Bit field masks: */
#define EEPROM_FACTORY_DATA_LDO_TRIM_LDO_TRIM_Msk  ((uint32_t)0x00000007)

/** @} */ /* End of group Memory_EEPROM_FACTORY_DATA_LDO_TRIM */

/** @defgroup Memory_EEPROM_FACTORY_DATA_UNIQ_IDx EEPROM FACTORY_DATA UNIQ_IDx
  * @{
  */

/*-- EEPROM_FACTORY_DATA_UNIQ_IDx: EEPROM FACTORY_DATA UNIQ_IDx Field -----*/
/* Bit field positions: */
#define EEPROM_FACTORY_DATA_UNIQ_IDx_UNIQ_IDx_Pos  0

/* Bit field masks: */
#define EEPROM_FACTORY_DATA_UNIQ_IDx_UNIQ_IDx_Msk  ((uint32_t)0xFFFFFFFF)

/** @} */ /* End of group Memory_EEPROM_FACTORY_DATA_UNIQ_IDx */

/** @} */ /* End of group K1986VE9xI_Memory_EEPROM_FACTORY_DATA_Defines */

/** @} */ /* End of group K1986VE9xI_Memory_EEPROM_FACTORY_DATA */

/** @} */ /* End of group __K1986VE9xI_Memory_Units */

/** @addtogroup __K1986VE9xI_Peripheral_Units K1986VE9xI Peripheral Units
  * @{
  */

/** @defgroup K1986VE9xI_Periph_CAN CAN
  * @{
  */

/** @defgroup K1986VE9xI_Periph_CAN_Data_Structures Data Structures
  * @{
  */

/* MDR_CAN_BUF_TypeDef structure */
typedef struct
{
  __IO uint32_t ID;
  __IO uint32_t DLC;
  __IO uint32_t DATAL;
  __IO uint32_t DATAH;
}MDR_CAN_BUF_TypeDef;

/* MDR_CAN_BUF_FILTER_TypeDef structure */
typedef struct
{
  __IO uint32_t MASK;
  __IO uint32_t FILTER;
}MDR_CAN_BUF_FILTER_TypeDef;

/* MDR_CAN_TypeDef structure */
typedef struct
{
  __IO uint32_t CONTROL;
  __IO uint32_t STATUS;
  __IO uint32_t BITTMNG;
       uint32_t RESERVED0;
  __IO uint32_t INT_EN;
       uint32_t RESERVED1[2];
  __IO uint32_t OVER;
  __IO uint32_t RXID;
  __IO uint32_t RXDLC;
  __IO uint32_t RXDATAL;
  __IO uint32_t RXDATAH;
  __IO uint32_t TXID;
  __IO uint32_t TXDLC;
  __IO uint32_t DATAL;
  __IO uint32_t DATAH;
  __IO uint32_t BUF_CON[32];
  __IO uint32_t INT_RX;
  __IO uint32_t RX;
  __IO uint32_t INT_TX;
  __IO uint32_t TX;
       uint32_t RESERVED2[76];
    MDR_CAN_BUF_TypeDef CAN_BUF[32];
       uint32_t RESERVED3[64];
    MDR_CAN_BUF_FILTER_TypeDef CAN_BUF_FILTER[32];
}MDR_CAN_TypeDef;

/** @} */ /* End of group K1986VE9xI_Periph_CAN_Data_Structures */

