unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE9xI/inc/K1986VE9xI.h
/** @} */ /* End of group RST_CLK_PLL_CONTROL */

/** @defgroup Periph_RST_CLK_HS_CONTROL	RST CLK HS CONTROL
  * @{
  */ 

/*-- RST_CLK_HS_CONTROL: HS Control Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_HS_CONTROL_HSE_ON_Pos           0
#define RST_CLK_HS_CONTROL_HSE_BYP_Pos          1

/* Bit field masks: */
#define RST_CLK_HS_CONTROL_HSE_ON               ((uint32_t)0x00000001)
#define RST_CLK_HS_CONTROL_HSE_BYP              ((uint32_t)0x00000002)

/** @} */ /* End of group RST_CLK_HS_CONTROL */

/** @defgroup Periph_RST_CLK_CPU_CLOCK	RST CLK CPU CLOCK
  * @{
  */ 

/*-- RST_CLK_CPU_CLOCK: CPU Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos        0
#define RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos        2
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos        4
#define RST_CLK_CPU_CLOCK_HCLK_SEL_Pos          8

/* Bit field masks: */
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_Msk        ((uint32_t)0x00000003)
#define RST_CLK_CPU_CLOCK_CPU_C2_SEL            ((uint32_t)0x00000004)
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_Msk        ((uint32_t)0x000000F0)
#define RST_CLK_CPU_CLOCK_HCLK_SEL_Msk          ((uint32_t)0x00000300)

/** @} */ /* End of group RST_CLK_CPU_CLOCK */

/** @defgroup Periph_RST_CLK_USB_CLOCK	RST CLK USB CLOCK
  * @{
  */ 

/*-- RST_CLK_USB_CLOCK: USB Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_USB_CLOCK_USB_C1_SEL_Pos        0
#define RST_CLK_USB_CLOCK_USB_C2_SEL_Pos        2
#define RST_CLK_USB_CLOCK_USB_C3_SEL_Pos        4
#define RST_CLK_USB_CLOCK_USB_CLK_EN_Pos        8

/* Bit field masks: */
#define RST_CLK_USB_CLOCK_USB_C1_SEL_Msk        ((uint32_t)0x00000003)
#define RST_CLK_USB_CLOCK_USB_C2_SEL            ((uint32_t)0x00000004)
#define RST_CLK_USB_CLOCK_USB_C3_SEL	        ((uint32_t)0x00000010)
#define RST_CLK_USB_CLOCK_USB_CLK_EN            ((uint32_t)0x00000100)

/** @} */ /* End of group RST_CLK_USB_CLOCK */

/** @defgroup Periph_RST_CLK_ADC_MCO_CLOCK	RST CLK ADC MCO CLOCK
  * @{
  */ 

/*-- RST_CLK_ADC_MCO_CLOCK: ADC Clock Register ---------------------*/
/* Bit field positions: */
#define RST_CLK_ADC_MCO_CLOCK_ADC_C1_SEL_Pos    0
#define RST_CLK_ADC_MCO_CLOCK_ADC_C2_SEL_Pos    4
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_Pos    8
#define RST_CLK_ADC_MCO_CLOCK_ADC_CLK_EN_Pos    13

/* Bit field masks: */
#define RST_CLK_ADC_MCO_CLOCK_ADC_C1_SEL_Msk    ((uint32_t)0x00000003)
#define RST_CLK_ADC_MCO_CLOCK_ADC_C2_SEL_Msk    ((uint32_t)0x00000030)
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_Msk    ((uint32_t)0x00000F00)
#define RST_CLK_ADC_MCO_CLOCK_ADC_CLK_EN        ((uint32_t)0x00002000)

/** @} */ /* End of group RST_CLK_ADC_MCO_CLOCK */

/** @defgroup Periph_RST_CLK_RTC_CLOCK	RST CLK RTC CLOCK
  * @{
  */ 

/*-- RST_CLK_RTC_CLOCK: RTC Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_RTC_CLOCK_HSE_SEL_Pos           0
#define RST_CLK_RTC_CLOCK_HSI_SEL_Pos           4
#define RST_CLK_RTC_CLOCK_HSE_RTC_EN_Pos        8
#define RST_CLK_RTC_CLOCK_HSI_RTC_EN_Pos        9

/* Bit field masks: */
#define RST_CLK_RTC_CLOCK_HSE_SEL_Msk           ((uint32_t)0x0000000F)
#define RST_CLK_RTC_CLOCK_HSI_SEL_Msk           ((uint32_t)0x000000F0)
#define RST_CLK_RTC_CLOCK_HSE_RTC_EN            ((uint32_t)0x00000100)
#define RST_CLK_RTC_CLOCK_HSI_RTC_EN            ((uint32_t)0x00000200)

/** @} */ /* End of group RST_CLK_RTC_CLOCK */

/** @defgroup Periph_RST_CLK_PER_CLOCK RST_CLK PER_CLOCK
  * @{
  */

/*-- RST_CLK_PER_CLOCK:RST_CLK PER_CLOCK Register -----*/

#define RST_CLK_PER_CLOCK_PCLK_EN_CAN1_Pos    0
#define RST_CLK_PER_CLOCK_PCLK_EN_CAN1_Msk    (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_CAN1_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_CAN1        RST_CLK_PER_CLOCK_PCLK_EN_CAN1_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_CAN2_Pos    1
#define RST_CLK_PER_CLOCK_PCLK_EN_CAN2_Msk    (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_CAN2_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_CAN2        RST_CLK_PER_CLOCK_PCLK_EN_CAN2_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_USB_Pos     2
#define RST_CLK_PER_CLOCK_PCLK_EN_USB_Msk     (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_USB_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_USB         RST_CLK_PER_CLOCK_PCLK_EN_USB_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_EEPROM_Pos  3
#define RST_CLK_PER_CLOCK_PCLK_EN_EEPROM_Msk  (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_EEPROM_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_EEPROM      RST_CLK_PER_CLOCK_PCLK_EN_EEPROM_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK_Pos 4
#define RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK_Msk (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK     RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_DMA_Pos     5
#define RST_CLK_PER_CLOCK_PCLK_EN_DMA_Msk     (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_DMA_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_DMA         RST_CLK_PER_CLOCK_PCLK_EN_DMA_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_UART1_Pos   6
#define RST_CLK_PER_CLOCK_PCLK_EN_UART1_Msk   (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_UART1_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_UART1       RST_CLK_PER_CLOCK_PCLK_EN_UART1_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_UART2_Pos   7
#define RST_CLK_PER_CLOCK_PCLK_EN_UART2_Msk   (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_UART2_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_UART2       RST_CLK_PER_CLOCK_PCLK_EN_UART2_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_SSP1_Pos    8
#define RST_CLK_PER_CLOCK_PCLK_EN_SSP1_Msk    (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_SSP1_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_SSP1        RST_CLK_PER_CLOCK_PCLK_EN_SSP1_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_I2C_Pos     10
#define RST_CLK_PER_CLOCK_PCLK_EN_I2C_Msk     (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_I2C_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_I2C         RST_CLK_PER_CLOCK_PCLK_EN_I2C_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_POWER_Pos   11
#define RST_CLK_PER_CLOCK_PCLK_EN_POWER_Msk   (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_POWER_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_POWER       RST_CLK_PER_CLOCK_PCLK_EN_POWER_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_WWDG_Pos    12
#define RST_CLK_PER_CLOCK_PCLK_EN_WWDG_Msk    (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_WWDG_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_WWDG        RST_CLK_PER_CLOCK_PCLK_EN_WWDG_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_IWDG_Pos    13
#define RST_CLK_PER_CLOCK_PCLK_EN_IWDG_Msk    (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_IWDG_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_IWDG        RST_CLK_PER_CLOCK_PCLK_EN_IWDG_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER1_Pos  14
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER1_Msk  (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_TIMER1_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER1      RST_CLK_PER_CLOCK_PCLK_EN_TIMER1_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER2_Pos  15
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER2_Msk  (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_TIMER2_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER2      RST_CLK_PER_CLOCK_PCLK_EN_TIMER2_Msk

