unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE9xI/inc/K1986VE9xI.h
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER3_Pos  16
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER3_Msk  (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_TIMER3_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER3      RST_CLK_PER_CLOCK_PCLK_EN_TIMER3_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_ADC_Pos     17
#define RST_CLK_PER_CLOCK_PCLK_EN_ADC_Msk     (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_ADC_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_ADC         RST_CLK_PER_CLOCK_PCLK_EN_ADC_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_DAC_Pos     18
#define RST_CLK_PER_CLOCK_PCLK_EN_DAC_Msk     (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_DAC_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_DAC         RST_CLK_PER_CLOCK_PCLK_EN_DAC_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_COMP_Pos    19
#define RST_CLK_PER_CLOCK_PCLK_EN_COMP_Msk    (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_TIMER4_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_COMP        RST_CLK_PER_CLOCK_PCLK_EN_TIMER4_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_SSP2_Pos    20
#define RST_CLK_PER_CLOCK_PCLK_EN_SSP2_Msk    (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_SSP2_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_SSP2        RST_CLK_PER_CLOCK_PCLK_EN_SSP2_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTA_Pos   21
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTA_Msk   (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTA_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTA       RST_CLK_PER_CLOCK_PCLK_EN_PORTA_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTB_Pos   22
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTB_Msk   (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTB_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTB       RST_CLK_PER_CLOCK_PCLK_EN_PORTB_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTC_Pos   23
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTC_Msk   (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTC_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTC       RST_CLK_PER_CLOCK_PCLK_EN_PORTC_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTD_Pos   24
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTD_Msk   (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTD_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTD       RST_CLK_PER_CLOCK_PCLK_EN_PORTD_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTE_Pos   25
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTE_Msk   (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTE_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTE       RST_CLK_PER_CLOCK_PCLK_EN_PORTE_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_BKP_Pos     27
#define RST_CLK_PER_CLOCK_PCLK_EN_BKP_Msk     (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_BKP_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_BKP         RST_CLK_PER_CLOCK_PCLK_EN_BKP_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTF_Pos   29
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTF_Msk   (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTF_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTF       RST_CLK_PER_CLOCK_PCLK_EN_PORTF_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_EBC_Pos     30
#define RST_CLK_PER_CLOCK_PCLK_EN_EBC_Msk     (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_EBC_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_EBC         RST_CLK_PER_CLOCK_PCLK_EN_EBC_Msk

/* Bit field positions: */
#define RST_CLK_PER_CLOCK_PCLK_EN_Pos         0

/* Bit field masks: */
#define RST_CLK_PER_CLOCK_PCLK_EN_Msk         ((uint32_t)0xFFFFFFFF)

/** @} */ /* End of group RST_CLK_PER_CLOCK */

/** @defgroup Periph_RST_CLK_CAN_CLOCK	RST CLK CAN CLOCK
  * @{
  */ 

/*-- RST_CLK_CAN_CLOCK: CAN Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_CAN_CLOCK_CAN1_BRG_Pos          0
#define RST_CLK_CAN_CLOCK_CAN2_BRG_Pos          8
#define RST_CLK_CAN_CLOCK_CAN1_CLK_EN_Pos       24
#define RST_CLK_CAN_CLOCK_CAN2_CLK_EN_Pos       25

/* Bit field masks: */
#define RST_CLK_CAN_CLOCK_CAN1_BRG_Msk          ((uint32_t)0x000000FF)
#define RST_CLK_CAN_CLOCK_CAN2_BRG_Msk          ((uint32_t)0x0000FF00)
#define RST_CLK_CAN_CLOCK_CAN1_CLK_EN           ((uint32_t)0x01000000)
#define RST_CLK_CAN_CLOCK_CAN2_CLK_EN           ((uint32_t)0x02000000)

/** @} */ /* End of group RST_CLK_CAN_CLOCK */

/** @defgroup Periph_RST_CLK_TIM_CLOCK	RST CLK TIM CLOCK
  * @{
  */ 

/*-- RST_CLK_TIM_CLOCK: Timer Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_TIM_CLOCK_TIM1_BRG_Pos          0
#define RST_CLK_TIM_CLOCK_TIM2_BRG_Pos          8
#define RST_CLK_TIM_CLOCK_TIM3_BRG_Pos          16
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Pos       24
#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN_Pos       25
#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN_Pos       26

/* Bit field masks: */
#define RST_CLK_TIM_CLOCK_TIM1_BRG_Msk          ((uint32_t)0x000000FF)
#define RST_CLK_TIM_CLOCK_TIM2_BRG_Msk          ((uint32_t)0x0000FF00)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_Msk          ((uint32_t)0x00FF0000)
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN           ((uint32_t)0x01000000)
#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN           ((uint32_t)0x02000000)
#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN           ((uint32_t)0x04000000)

/** @} */ /* End of group RST_CLK_TIM_CLOCK */

/** @defgroup Periph_RST_CLK_UART_CLOCK	RST CLK UART CLOCK
  * @{
  */ 

/*-- RST_CLK_UART_CLOCK: UART Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_UART_CLOCK_UART1_BRG_Pos        0
#define RST_CLK_UART_CLOCK_UART2_BRG_Pos        8
#define RST_CLK_UART_CLOCK_UART1_CLK_EN_Pos     24
#define RST_CLK_UART_CLOCK_UART2_CLK_EN_Pos     25

/* Bit field masks: */
#define RST_CLK_UART_CLOCK_UART1_BRG_Msk        ((uint32_t)0x000000FF)
#define RST_CLK_UART_CLOCK_UART2_BRG_Msk        ((uint32_t)0x0000FF00)
#define RST_CLK_UART_CLOCK_UART1_CLK_EN         ((uint32_t)0x01000000)
#define RST_CLK_UART_CLOCK_UART2_CLK_EN         ((uint32_t)0x02000000)

/** @} */ /* End of group RST_CLK_UART_CLOCK */

/** @defgroup Periph_RST_CLK_SSP_CLOCK	RST CLK SSP CLOCK
  * @{
  */ 

/*-- RST_CLK_SSP_CLOCK: SSP Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_SSP_CLOCK_SSP1_BRG_Pos          0
#define RST_CLK_SSP_CLOCK_SSP2_BRG_Pos          8
#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN_Pos       24
#define RST_CLK_SSP_CLOCK_SSP2_CLK_EN_Pos       25

/* Bit field masks: */
#define RST_CLK_SSP_CLOCK_SSP1_BRG_Msk          ((uint32_t)0x000000FF)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_Msk          ((uint32_t)0x0000FF00)
#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN           ((uint32_t)0x01000000)
#define RST_CLK_SSP_CLOCK_SSP2_CLK_EN           ((uint32_t)0x02000000)

/** @} */ /* End of group RST_CLK_SSP_CLOCK */

