unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE9xI/inc/K1986VE9xI.h
/*-- ADC1_RESULT: ADC1 Result Register -----------------------------*/
/*-- ADC2_RESULT: ADC2 Result Register -----------------------------*/
/* Bit field positions: */
#define ADC_RESULT_Pos                          0
#define ADC_RESULT_CHANNEL_Pos                  16

/* Bit field masks: */
#define ADC_RESULT_Msk                          ((uint32_t)0x00000FFF)
#define ADC_RESULT_CHANNEL_Msk                  ((uint32_t)0x0FFF0000)

/** @} */ /* End of group ADC1_RESULT */

/** @defgroup Periph_ADC1_STATUS	ADC1 STATUS
  * @{
  */ 

/*-- ADC1_STATUS: ADC1 Status Register -----------------------------*/
/*-- ADC2_STATUS: ADC2 Status Register -----------------------------*/
/* Bit field positions: */
#define ADC_STATUS_FLG_REG_OVERWRITE_Pos        0
#define ADC_STATUS_FLG_REG_AWOIFEN_Pos          1
#define ADC_STATUS_FLG_REG_EOCIF_Pos            2
#define ADC_STATUS_AWOIF_IE_Pos                 3
#define ADC_STATUS_ECOIF_IE_Pos                 4

/* Bit field masks: */
#define ADC_STATUS_FLG_REG_OVERWRITE            ((uint32_t)0x00000001)
#define ADC_STATUS_FLG_REG_AWOIFEN              ((uint32_t)0x00000002)
#define ADC_STATUS_FLG_REG_EOCIF                ((uint32_t)0x00000004)
#define ADC_STATUS_AWOIF_IE                     ((uint32_t)0x00000008)
#define ADC_STATUS_ECOIF_IE                     ((uint32_t)0x00000010)

/** @} */ /* End of group ADC1_STATUS */

/** @} */ /* End of group K1986VE9xI_Periph_ADC_Defines */

/** @} */ /* End of group K1986VE9xI_Periph_ADC */

/** @defgroup K1986VE9xI_Periph_DAC DAC
  * @{
  */

/** @defgroup K1986VE9xI_Periph_DAC_Data_Structures Data Structures
  * @{
  */

/* MDR_DAC_TypeDef structure */
typedef struct
{
  __IO uint32_t CFG;
  __IO uint32_t DAC1_DATA;
  __IO uint32_t DAC2_DATA;
}MDR_DAC_TypeDef;

/** @} */ /* End of group K1986VE9xI_Periph_DAC_Data_Structures */

/** @defgroup K1986VE9xI_Periph_DAC_Defines Defines
  * @{
  */

/** @defgroup Periph_DAC_CFG	DAC CFG
  * @{
  */ 

/*-- DAC_CFG: DAC Configuration Register ---------------------------*/
/* Bit field positions: */
#define DAC_CFG_M_REF0_Pos                      0
#define DAC_CFG_M_REF1_Pos                      1
#define DAC_CFG_ON_DAC0_Pos                     2
#define DAC_CFG_ON_DAC1_Pos                     3
#define DAC_CFG_SYNC_A_Pos                      4

/* Bit field masks: */
#define DAC_CFG_M_REF0                          ((uint32_t)0x00000001)
#define DAC_CFG_M_REF1                          ((uint32_t)0x00000002)
#define DAC_CFG_ON_DAC0                         ((uint32_t)0x00000004)
#define DAC_CFG_ON_DAC1                         ((uint32_t)0x00000008)
#define DAC_CFG_SYNC_A                          ((uint32_t)0x00000010)

/** @} */ /* End of group DAC_CFG */

/** @defgroup Periph_DAC1_DATA	DAC1 DATA
  * @{
  */ 

/*-- DAC1_DATA: DAC1 Data Register ---------------------------------*/
/* Bit field positions: */
#define DAC1_DATA_DAC0DATA_Pos                  0
#define DAC1_DATA_DAC1DATA_Pos                  16

/* Bit field masks: */
#define DAC1_DATA_DAC0DATA_Msk                  ((uint32_t)0x00000FFF)
#define DAC1_DATA_DAC1DATA_Msk                  ((uint32_t)0x0FFF0000)

/** @} */ /* End of group DAC1_DATA */

/** @defgroup Periph_DAC2_DATA	DAC2 DATA
  * @{
  */ 

/*-- DAC2_DATA: DAC2 Data Register ---------------------------------*/
/* Bit field positions: */
#define DAC2_DATA_DAC1DATA_Pos                  0
#define DAC2_DATA_DAC0DATA_Pos                  16

/* Bit field masks: */
#define DAC2_DATA_DAC1DATA_Msk                  ((uint32_t)0x00000FFF)
#define DAC2_DATA_DAC0DATA_Msk                  ((uint32_t)0x0FFF0000)

/** @} */ /* End of group DAC2_DATA */

/** @} */ /* End of group K1986VE9xI_Periph_DAC_Defines */

/** @} */ /* End of group K1986VE9xI_Periph_DAC */

/** @defgroup K1986VE9xI_Periph_COMP COMP
  * @{
  */

/** @defgroup K1986VE9xI_Periph_COMP_Data_Structures Data Structures
  * @{
  */

/* MDR_COMP_TypeDef structure */
typedef struct
{
  __IO uint32_t CFG;
  __IO uint32_t RESULT;
  __IO uint32_t RESULT_LATCH;
}MDR_COMP_TypeDef;

/** @} */ /* End of group K1986VE9xI_Periph_COMP_Data_Structures */

/** @defgroup K1986VE9xI_Periph_COMP_Defines Defines
  * @{
  */

/** @defgroup Periph_COMP_CFG	COMP CFG
  * @{
  */ 

/*-- COMP_CFG: COMP Configuration Register -------------------------*/
/* Bit field positions: */
#define COMP_CFG_ON_Pos                         0
#define COMP_CFG_CVRR_Pos                       1
#define COMP_CFG_CVRSS_Pos                      2
#define COMP_CFG_CVREN_Pos                      3
#define COMP_CFG_CVR_Pos                        4
#define COMP_CFG_CREF_Pos                       8
#define COMP_CFG_CCH_Pos                        9
#define COMP_CFG_INV_Pos                        11
#define COMP_CFG_READY_Pos                      12
#define COMP_CFG_CMPIE_Pos                      13

/* Bit field masks: */
#define COMP_CFG_ON                             ((uint32_t)0x00000001)
#define COMP_CFG_CVRR                           ((uint32_t)0x00000002)
#define COMP_CFG_CVRSS                          ((uint32_t)0x00000004)
#define COMP_CFG_CVREN                          ((uint32_t)0x00000008)
#define COMP_CFG_CVR_Msk                        ((uint32_t)0x000000F0)
#define COMP_CFG_CREF                           ((uint32_t)0x00000100)
#define COMP_CFG_CCH_Msk                        ((uint32_t)0x00000600)
#define COMP_CFG_INV                            ((uint32_t)0x00000800)
#define COMP_CFG_READY                          ((uint32_t)0x00001000)
#define COMP_CFG_CMPIE                          ((uint32_t)0x00002000)

/** @} */ /* End of group COMP_CFG */

/** @defgroup Periph_COMP_RESULT	COMP RESULT
  * @{
  */ 

/*-- COMP_RESULT: COMP Result Register -----------------------------*/
/* Bit field positions: */
#define COMP_RESULT_RSLT_SY_Pos                 0
#define COMP_RESULT_RSLT_AS_Pos                 1
#define COMP_RESULT_RST_LCH_Pos                 2

/* Bit field masks: */
#define COMP_RESULT_RSLT_SY                     ((uint32_t)0x00000001)
#define COMP_RESULT_RSLT_AS                     ((uint32_t)0x00000002)
#define COMP_RESULT_RST_LCH                     ((uint32_t)0x00000004)

/** @} */ /* End of group COMP_RESULT */

